Revit 2027 API
FabricationItemFolder.GetSubFolders Method
 Gets the item folder's sub folders.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<FabricationItemFolder> GetSubFolders()
Public Function GetSubFolders As IList(Of FabricationItemFolder)
public:
IList<FabricationItemFolder^>^ GetSubFolders()
member GetSubFolders : unit -> IList<FabricationItemFolder>
Return Value
IList<FabricationItemFolder>
See Also
Reference
FabricationItemFolder Class
Autodesk.Revit.DB Namespace